In [1]:
import numpy as np
import pandas as pd

In [3]:
sr1 = pd.Series([10,20,30,40,50])

In [4]:
sr1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
sr1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [6]:
sr1.dtype

dtype('int64')

In [7]:
sr1 = pd.Series([10,20,30,40,50], index=['a','b','c','d','e']) 
sr1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
sd = {'sunny':999999, 'pyo':1000000, 'kildong':200000,'jungjae':50000000}

In [9]:
sr3 = pd.Series(sd)
sr3

jungjae    50000000
kildong      200000
pyo         1000000
sunny        999999
dtype: int64

In [10]:
sr3.name = '월급'

In [11]:
sr3.index.name = '이름'

In [12]:
sr3

이름
jungjae    50000000
kildong      200000
pyo         1000000
sunny        999999
Name: 월급, dtype: int64

In [13]:
data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
        "year": [2016, 2017, 2018, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9]}

In [15]:
df = pd.DataFrame(data) 
df

      names  points  year
0  sunyoung     1.5  2016
1  sunyoung     1.7  2017
2  sunyoung     3.6  2018
3   jungjae     2.4  2015
4   jungjae     2.9  2016

In [16]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df.columns

Index(['names', 'points', 'year'], dtype='object')

In [18]:
df.values

array([['sunyoung', 1.5, 2016],
       ['sunyoung', 1.7, 2017],
       ['sunyoung', 3.6, 2018],
       ['jungjae', 2.4, 2015],
       ['jungjae', 2.9, 2016]], dtype=object)

In [19]:
df

      names  points  year
0  sunyoung     1.5  2016
1  sunyoung     1.7  2017
2  sunyoung     3.6  2018
3   jungjae     2.4  2015
4   jungjae     2.9  2016

In [20]:
df2 = pd.DataFrame(data, 
                   columns=['year','names','points','penalty'],
                  index=['one','two','three','four','five'])

In [21]:
df2

       year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN

In [22]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [23]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [24]:
df2.values

array([[2016, 'sunyoung', 1.5, nan],
       [2017, 'sunyoung', 1.7, nan],
       [2018, 'sunyoung', 3.6, nan],
       [2015, 'jungjae', 2.4, nan],
       [2016, 'jungjae', 2.9, nan]], dtype=object)

In [25]:
df2.describe()

              year    points
count     5.000000  5.000000
mean   2016.400000  2.420000
std       1.140175  0.864292
min    2015.000000  1.500000
25%    2016.000000  1.700000
50%    2016.000000  2.400000
75%    2017.000000  2.900000
max    2018.000000  3.600000

In [26]:
df2.describe

<bound method NDFrame.describe of        year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN>